RedditClone/app/controllers/users_controller.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "F5uMCPmRRpTi0qI9TncgNQ=="], ["updated_at", "2022-01-21 20:14:55.787557"], ["id", 5]]
---
    def create
        @user = User.create(user_params)
        if @user.save